## Production: alarms 🚨
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 4 to add, 1 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                 NAME                                 |
|--------|----------------------------------------------------------------------|
| add    | `aws_cloudwatch_log_metric_filter.glue_etl_data_pythonshell_anomaly` |
|        | `aws_cloudwatch_log_metric_filter.glue_etl_data_spark_anomaly`       |
|        | `aws_cloudwatch_metric_alarm.glue_etl_data_anomaly`                  |
|        | `aws_cloudwatch_query_definition.glue_etl_data_anomaly`              |
| update | `aws_cloudwatch_query_definition.glue_etl_spark_errors`              |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_cloudwatch_log_metric_filter.glue_etl_data_pythonshell_anomaly will be created
  + resource "aws_cloudwatch_log_metric_filter" "glue_etl_data_pythonshell_anomaly" {
      + id             = (known after apply)
      + log_group_name = "/aws-glue/python-jobs/encryption-at-rest-role/service-role/AWSGlueETL-DataLake/error"
      + name           = "glue-etl-data-pythonshell-anomaly"
      + pattern        = "Data-Anomaly"

      + metric_transformation {
          + default_value = "0"
          + name          = "glue-etl-pythonshell-anomaly"
          + namespace     = "data-lake"
          + unit          = "Count"
          + value         = "1"
        }
    }

  # aws_cloudwatch_log_metric_filter.glue_etl_data_spark_anomaly will be created
  + resource "aws_cloudwatch_log_metric_filter" "glue_etl_data_spark_anomaly" {
      + id             = (known after apply)
      + log_group_name = "/aws-glue/jobs/encryption-at-rest-role/service-role/AWSGlueETL-DataLake/error"
      + name           = "glue-etl-data-spark-anomaly"
      + pattern        = "Data-Anomaly"

      + metric_transformation {
          + default_value = "0"
          + name          = "glue-etl-spark-anomaly"
          + namespace     = "data-lake"
          + unit          = "Count"
          + value         = "1"
        }
    }

  # aws_cloudwatch_metric_alarm.glue_etl_data_anomaly will be created
  + resource "aws_cloudwatch_metric_alarm" "glue_etl_data_anomaly" {
      + actions_enabled                       = true
      + alarm_actions                         = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-alarm-action",
        ]
      + alarm_description                     = "Data anomaly logged over 1 minute by a Glue ETL job."
      + alarm_name                            = "glue-etl-data-anomaly"
      + arn                                   = (known after apply)
      + comparison_operator                   = "GreaterThanThreshold"
      + evaluate_low_sample_count_percentiles = (known after apply)
      + evaluation_periods                    = 1
      + id                                    = (known after apply)
      + ok_actions                            = [
          + "arn:aws:sns:ca-central-1:739275439843:cloudwatch-ok-action",
        ]
      + tags_all                              = {
          + "CostCentre" = "PlatformDataLake"
          + "Terraform"  = "true"
        }
      + threshold                             = 0
      + treat_missing_data                    = "notBreaching"

      + metric_query {
          + id          = "pythonshell_anomaly"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + metric_name = "glue-etl-pythonshell-anomaly"
              + namespace   = "data-lake"
              + period      = 60
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + id          = "spark_anomaly"
          + return_data = false
            # (3 unchanged attributes hidden)

          + metric {
              + metric_name = "glue-etl-spark-anomaly"
              + namespace   = "data-lake"
              + period      = 60
              + stat        = "Sum"
                # (1 unchanged attribute hidden)
            }
        }
      + metric_query {
          + expression  = "pythonshell_anomaly + spark_anomaly"
          + id          = "anomaly_expression"
          + label       = "Combined Anomalies"
          + return_data = true
            # (1 unchanged attribute hidden)
        }
    }

  # aws_cloudwatch_query_definition.glue_etl_data_anomaly will be created
  + resource "aws_cloudwatch_query_definition" "glue_etl_data_anomaly" {
      + id                  = (known after apply)
      + log_group_names     = [
          + "/aws-glue/python-jobs/encryption-at-rest-role/service-role/AWSGlueETL-DataLake/error",
          + "/aws-glue/jobs/encryption-at-rest-role/service-role/AWSGlueETL-DataLake/error",
        ]
      + name                = "Glue ETL - Data Anomaly"
      + query_definition_id = (known after apply)
      + query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /Data-Anomaly/
            | sort @timestamp desc
            | limit 100
        EOT
    }

  # aws_cloudwatch_query_definition.glue_etl_spark_errors will be updated in-place
  ~ resource "aws_cloudwatch_query_definition" "glue_etl_spark_errors" {
        id                  = "22bcab94-6520-4bee-afb7-bad5179b619c"
        name                = "Glue ETL spark - ERRORS"
      ~ query_string        = <<-EOT
            fields @timestamp, @message, @logStream
            | filter @message like /ERROR/
          + | filter @message like /com.amazonaws.services.glue.log.GlueLogger/
            | sort @timestamp desc
            | limit 100
        EOT
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_event_rule.glue_job_failure"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_crawler_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_etl_data_anomaly"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_etl_pythonshell_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_etl_spark_error"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudwatch_metric_alarm.glue_job_failures"]
WARN - plan.json - main - Missing Common Tags: ["aws_kms_key.cloudwatch"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_alarm_action"]
WARN - plan.json - main - Missing Common Tags: ["aws_sns_topic.cloudwatch_ok_action"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.glue_etl_data_pythonshell_anomaly"]
WARN - plan.json - main - Cloudwatch log metric pattern is invalid: ["aws_cloudwatch_log_metric_filter.glue_etl_data_spark_anomaly"]

29 tests, 18 passed, 11 warnings, 0 failures, 0 exceptions

```

</details>
